#pragma once
/*****************************************************************//**
 * \file   all.h
 * \brief  
 * 
 * \author mycai
 * \date   October 2025
 * 
 * 
 * 解题步骤
 * 1.解析题目
 *	-仔细阅读题目，弄懂题目的意思
 * ·-不要着急选择模式，要在彻底弄懂题目的意思后，谨慎的选择方法
 *	-错误的模式，可能会浪费时间
 * 
 * 
 * 2.抽象方法
 *	-将题目归于某一类问题后，尝试写出其数学抽象表达
 * ·-尝试将corner case和normal case都代入到数学公式中，验证是否通过
 *	-如果遇到需要证明的地方，可以暂时跳过。先通过提交来快速验证思路
 * 
 * 
 * 3.提交
 * 
 * 
 * 4.模式切换
 *	-如果一直解决不了，尝试跳过现有模式。尝试其他模式
 * 
 * 
 * 
 *********************************************************************/
